# Exploratory data analysis


### 1. Reading the data

In [3]:
import pandas as pd

filename = '/Users/Guzel/Documents/KAGGLE/Human Resources Analytics/HR_comma_sep.csv'

# data ia a dataFrame object
data = pd.read_csv(filename)

# Print the head of the data frame
data.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [4]:
# Number of rows and columns

print(data.shape)

(14999, 10)

In [5]:
# Columns of dataFrame data
data.columns

Index(['satisfaction_level', 'last_evaluation', 'number_project',
       'average_montly_hours', 'time_spend_company', 'Work_accident', 'left',
       'promotion_last_5years', 'sales', 'salary'],
      dtype='object')

In [6]:
data.index

RangeIndex(start=0, stop=14999, step=1)

In [7]:
# Slicing the data

data.iloc[-5: , 2:7]

,number_project,average_montly_hours,time_spend_company,Work_accident,left
14994,2,151,3,0,1
14995,2,160,3,0,1
14996,2,143,3,0,1
14997,6,280,4,0,1
14998,2,158,3,0,1

In [8]:
data.tail(3)

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
14996,0.37,0.53,2,143,3,0,1,0,support,low
14997,0.11,0.96,6,280,4,0,1,0,support,low
14998,0.37,0.52,2,158,3,0,1,0,support,low

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14999 entries, 0 to 14998
Data columns (total 10 columns):
satisfaction_level       14999 non-null float64
last_evaluation          14999 non-null float64
number_project           14999 non-null int64
average_montly_hours     14999 non-null int64
time_spend_company       14999 non-null int64
Work_accident            14999 non-null int64
left                     14999 non-null int64
promotion_last_5years    14999 non-null int64
sales                    14999 non-null object
salary                   14999 non-null object
dtypes: float64(2), int64(6), object(2)
memory usage: 1.1+ MB

sat_level = data['satisfaction_level']

In [11]:
print(sat_level[0:50])

0     0.38
1     0.80
2     0.11
3     0.72
4     0.37
5     0.41
6     0.10
7     0.92
8     0.89
9     0.42
10    0.45
11    0.11
12    0.84
13    0.41
14    0.36
15    0.38
16    0.45
17    0.78
18    0.45
19    0.76
20    0.11
21    0.38
22    0.09
23    0.46
24    0.40
25    0.89
26    0.82
27    0.40
28    0.41
29    0.38
30    0.09
31    0.45
32    0.40
33    0.45
34    0.84
35    0.10
36    0.38
37    0.45
38    0.11
39    0.41
40    0.87
41    0.45
42    0.40
43    0.10
44    0.09
45    0.84
46    0.40
47    0.57
48    0.40
49    0.43
Name: satisfaction_level, dtype: float64